Revit 2027 API
TableData.FreezeColumnsAndRows Property
 set to true if the columns and rows should be unmovable by the slider grips
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool FreezeColumnsAndRows { get; set; }
Public Property FreezeColumnsAndRows As Boolean
	Get
	Set
public:
property bool FreezeColumnsAndRows {
	bool get ();
	void set (bool value);
}
member FreezeColumnsAndRows : bool with get, set
Property Value
Boolean
See Also
Reference
TableData Class
Autodesk.Revit.DB Namespace